minh7a6/MinhUNO32-BLE/MinhUNO/STM32F1/boards.txt
########################### STM32VLD to FLASH ###########################

STM32VLD.name=STM32VLD to FLASH
#STM32VLD.vid.0=0x1EAF
#STM32VLD.pid.0=0x0004

STM32VLD.build.vect=VECT_TAB_ADDR=0x8000000
STM32VLD.build.core=maple
STM32VLD.build.board=STM32VLD
STM32VLD.build.variant=STM32VLD
STM32VLD.build.ldscript=ld/jtag.ld

STM32VLD.build.family=cortex-m3
STM32VLD.build.f_cpu=24000000L
STM32VLD.upload.use_1200bps_touch=false
STM32VLD.upload.file_type=bin
STM32VLD.upload.auto_reset=true
STM32VLD.upload.params.quiet=no

STM32VLD.build.cpu_flags=-DMCU_STM32F100RB

#---------------------------- UPLOAD METHODS ---------------------------

STM32VLD.menu.upload_method.STLinkMethod=STLink
STM32VLD.menu.upload_method.STLinkMethod.upload.protocol=STLink
STM32VLD.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
STM32VLD.menu.upload_method.STLinkMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG  

#-- CPU Clock frequency
STM32VLD.menu.cpu_speed.speed_72mhz=72Mhz (Normal)
STM32VLD.menu.cpu_speed.speed_72mhz.build.f_cpu=72000000L

STM32VLD.menu.cpu_speed.speed_48mhz=48Mhz (Slow - with USB)
STM32VLD.menu.cpu_speed.speed_48mhz.build.f_cpu=48000000L

STM32VLD.menu.cpu_speed.speed_128mhz=Overclocked 128Mhz NO USB SERIAL. MANUAL RESET NEEDED TO UPLOAD
STM32VLD.menu.cpu_speed.speed_128mhz.build.f_cpu=128000000L

#-- Optimizations
STM32VLD.menu.opt.osstd=Smallest (default)
STM32VLD.menu.opt.osstd.build.flags.optimize=-Os
STM32VLD.menu.opt.osstd.build.flags.ldspecs=
STM32VLD.menu.opt.oslto=Smallest Code with LTO
STM32VLD.menu.opt.oslto.build.flags.optimize=-Os -flto
STM32VLD.menu.opt.oslto.build.flags.ldspecs=-flto
STM32VLD.menu.opt.o1std=Fast (-O1)
STM32VLD.menu.opt.o1std.build.flags.optimize=-O1
STM32VLD.menu.opt.o1std.build.flags.ldspecs=
STM32VLD.menu.opt.o1lto=Fast (-O1) with LTO
STM32VLD.menu.opt.o1lto.build.flags.optimize=-O1 -flto
STM32VLD.menu.opt.o1lto.build.flags.ldspecs=-flto
STM32VLD.menu.opt.o2std=Faster (-O2)
STM32VLD.menu.opt.o2std.build.flags.optimize=-O2
STM32VLD.menu.opt.o2std.build.flags.ldspecs=
STM32VLD.menu.opt.o2lto=Faster (-O2) with LTO
STM32VLD.menu.opt.o2lto.build.flags.optimize=-O2 -flto
STM32VLD.menu.opt.o2lto.build.flags.ldspecs=-flto
STM32VLD.menu.opt.o3std=Fastest (-O3)
STM32VLD.menu.opt.o3std.build.flags.optimize=-O3
STM32VLD.menu.opt.o3std.build.flags.ldspecs=
STM32VLD.menu.opt.o3lto=Fastest (-O3) with LTO
STM32VLD.menu.opt.o3lto.build.flags.optimize=-O3 -flto
STM32VLD.menu.opt.ogstd=Debug (-g)
STM32VLD.menu.opt.o3lto.build.flags.ldspecs=-flto
STM32VLD.menu.opt.ogstd.build.flags.optimize=-Og
STM32VLD.menu.opt.ogstd.build.flags.ldspecs=

################################################################################

##############################MINHUNO32_BLE################################
minhUNO32_BLE.name=MinhUNO32 BLE

minhUNO32_BLE.build.board=MINHUNO32_BLE
minhUNO32_BLE.vid.0=0x1EAF
minhUNO32_BLE.pid.0=0x0004
minhUNO32_BLE.build.usb_product="MinhUNO32 BLE"
minhUNO32_BLE.build.core=maple
minhUNO32_BLE.build.cpu_flags=-DMCU_STM32F103CB -DSERIAL_USB
minhUNO32_BLE.build.variant=minhuno32_ble
minhUNO32_BLE.upload.usbID=1EAF:0003


minhUNO32_BLE.upload.tool=maple_upload
minhUNO32_BLE.upload.protocol=maple_dfu
minhUNO32_BLE.upload.use_1200bps_touch=false
minhUNO32_BLE.upload.file_type=bin
minhUNO32_BLE.upload.auto_reset=true

minhUNO32_BLE.build.vect=VECT_TAB_ADDR=0x8002000
minhUNO32_BLE.build.ldscript=ld/bootloader_20.ld
minhUNO32_BLE.upload.maximum_size=122880
minhUNO32_BLE.upload.maximum_data_size=20480
minhUNO32_BLE.upload.altID=2

#-- CPU Clock frequency

minhUNO32_BLE.build.f_cpu=48000000L

#-- Optimizations
minhUNO32_BLE.build.flags.optimize=-Os
minhUNO32_BLE.build.flags.ldspecs=



############################MINHUNO32############################
minhUNO32.name=MinhUNO32

minhUNO32.build.board=MINHUNO32
minhUNO32.vid.0=0x1EAF
minhUNO32.pid.0=0x0004
minhUNO32.build.usb_product="MinhUNO32"
minhUNO32.build.core=maple
minhUNO32.build.cpu_flags=-DMCU_STM32F103CB -DSERIAL_USB
minhUNO32.build.variant=minhuno32
minhUNO32.upload.usbID=1EAF:0003


minhUNO32.upload.tool=maple_upload
minhUNO32.upload.protocol=maple_dfu
minhUNO32.upload.use_1200bps_touch=false
minhUNO32.upload.file_type=bin
minhUNO32.upload.auto_reset=true

minhUNO32.build.vect=VECT_TAB_ADDR=0x8002000
minhUNO32.build.ldscript=ld/bootloader_20.ld
minhUNO32.upload.maximum_size=122880
minhUNO32.upload.maximum_data_size=20480
minhUNO32.upload.altID=2

#-- CPU Clock frequency

minhUNO32.build.f_cpu=48000000L

#-- Optimizations
minhUNO32.build.flags.optimize=-Os
minhUNO32.build.flags.ldspecs=



##############################################################